Update docs and gitignore for release
